[{"title":"Introduction to end-to-end analytics using Microsoft Fabric","summary":"Discover how Microsoft Fabric can meet your enterprise's analytics needs in one platform. Learn about Microsoft Fabric, how it works, and identify how you can use it for your analytics needs.","module":"introduction-end-analytics-use-microsoft-fabric"},{"title":"Get started with lakehouses in Microsoft Fabric","summary":"Lakehouses merge data lake storage flexibility with data warehouse analytics. Microsoft Fabric offers a lakehouse solution for comprehensive analytics on a single SaaS platform.","module":"get-started-lakehouses"},{"title":"Use Apache Spark in Microsoft Fabric","summary":"Apache Spark is a core technology for large-scale data analytics. Microsoft Fabric provides support for Spark clusters, enabling you to analyze and process data in a Lakehouse at scale.","module":"use-apache-spark-work-files-lakehouse"},{"title":"Work with Delta Lake tables in Microsoft Fabric","summary":"Tables in a Microsoft Fabric lakehouse are based on the Delta Lake storage format commonly used in Apache Spark. By using the enhanced capabilities of delta tables, you can create advanced analytics solutions.","module":"work-delta-lake-tables-fabric"},{"title":"Use Data Factory pipelines in Microsoft Fabric","summary":"Microsoft Fabric includes Data Factory capabilities, including the ability to create pipelines that orchestrate data ingestion and transformation tasks.","module":"use-data-factory-pipelines-fabric"},{"title":"Ingest Data with Dataflows Gen2 in Microsoft Fabric","summary":"Data ingestion is crucial in analytics. Microsoft Fabric's Data Factory offers Dataflows (Gen2) for visually creating multi-step data ingestion and transformation using Power Query Online.","module":"use-dataflow-gen-2-fabric"},{"title":"Get started with data warehouses in Microsoft Fabric","summary":"Data warehouses are analytical stores built on a relational schema to support SQL queries. Microsoft Fabric enables you to create a relational data warehouse in your workspace and integrate it easily with other elements of your end-to-end analytics solution.","module":"get-started-data-warehouse"},{"title":"Administer Microsoft Fabric","summary":"Microsoft Fabric is a SaaS solution for end-to-end data analytics. As an administrator, you can configure features and manage access to suit your organization's needs.","module":"administer-fabric"},{"title":"Organize a Fabric lakehouse using medallion architecture design","summary":"Explore the potential of the medallion architecture design in Microsoft Fabric. Organize and transform your data across Bronze, Silver, and Gold layers of a lakehouse for optimized analytics.","module":"describe-medallion-architecture"},{"title":"Ingest data with Spark and Microsoft Fabric notebooks","summary":"Discover how to use Apache Spark and Python for data ingestion into a Microsoft Fabric lakehouse. Fabric notebooks provide a scalable and systematic solution.","module":"ingest-data-with-spark-fabric-notebooks"},{"title":"Get started with Real-Time Intelligence in Microsoft Fabric","summary":"Analysis of real-time data streams is a critical capability for any modern data analytics solution. You can use the Real-Time Intelligence capabilities of Microsoft Fabric to ingest, query, and process streams of data.","module":"get-started-kusto-fabric"},{"title":"Use real time eventstreams in Microsoft Fabric","summary":"This module is an introduction to the Microsoft Fabric Eventstream within Real-Time Intelligence (RTI).","module":"explore-event-streams-microsoft-fabric"}]